In [137]:
print('Hello World')

Hello World

In [138]:
import pandas as pd
import numpy as np

In [139]:
## Series -> One Dimensional 

data = [1,2,3,4,5,6]
data = pd.Series(data)
print(data)
print(type(data))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [140]:
data = {
    'a' : 1,
    'b' : 2,
    'c' : 3
}

data = pd.Series(data)
print(data)
print(type(data))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [141]:
data = [10,20,30]
index = ['k','l','m']

data = pd.Series(data, index=index)
print(data)
print(data.shape)

k    10
l    20
m    30
dtype: int64
(3,)

In [142]:
## DataFrame -> Tabular Structure 

data = {
    'Name' : ['Krish', 'Aarunee', 'Aashish'],
    'Age' : ['25', '45', '19'],
    'City' : ['Bangalore', 'Baliia', 'Motihari'],
}

print(data)
data = pd.DataFrame(data)
print(data)

{'Name': ['Krish', 'Aarunee', 'Aashish'], 'Age': ['25', '45', '19'], 'City': ['Bangalore', 'Baliia', 'Motihari']}
      Name Age       City
0    Krish  25  Bangalore
1  Aarunee  45     Baliia
2  Aashish  19   Motihari

In [143]:
dataNumpy = np.array(data)
print(dataNumpy)

[['Krish' '25' 'Bangalore']
 ['Aarunee' '45' 'Baliia']
 ['Aashish' '19' 'Motihari']]

In [144]:
## Reading 

df = pd.read_csv('data/sales_data_sample.csv', encoding="latin1")

print(df.head(5))

df.info()

   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0        10107               30      95.70                2  2871.00
1        10121               34      81.35                5  2765.90
2        10134               41      94.74                2  3884.34
3        10145               45      83.26                6  3746.70
4        10159               49     100.00               14  5205.27

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0   2/24/2003 0:00  Shipped       1         2     2003  ...
1    5/7/2003 0:00  Shipped       2         5     2003  ...
2    7/1/2003 0:00  Shipped       3         7     2003  ...
3   8/25/2003 0:00  Shipped       3         8     2003  ...
4  10/10/2003 0:00  Shipped       4        10     2003  ...

                    ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0        897 Long Airport Avenue           NaN            NYC    NY
1             59 rue de l'Abbaye           NaN          Reims   NaN
2  27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3             78934 Hillside Dr.           NaN       Pasadena    CA
4                7734 Strong St.           NaN  San Francisco    CA

  POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0      10022     USA       NaN              Yu             Kwai    Small
1      51100  France      EMEA         Henriot             Paul    Small
2      75508  France      EMEA        Da Cunha           Daniel   Medium
3      90003     USA       NaN           Young            Julie   Medium
4        NaN     USA       NaN           Brown            Julie   Medium

[5 rows x 25 columns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB

In [145]:
orderNumber = df['ORDERNUMBER']
orderNumber

0       10107
1       10121
2       10134
3       10145
4       10159
        ...
2818    10350
2819    10373
2820    10386
2821    10397
2822    10414
Name: ORDERNUMBER, Length: 2823, dtype: int64

In [146]:
data = {
    'Name' : ['Aashish', 'Aarunee', 'Ranjan', 'Aditya'],
    'Age' : ['19', '22', '15', '62'],
    'City' : ['Motihari', 'Ballia', 'Jammmu', 'Patna'],
}

df = pd.DataFrame(data)
print(df.head())

      Name Age      City
0  Aashish  19  Motihari
1  Aarunee  22    Ballia
2   Ranjan  15    Jammmu
3   Aditya  62     Patna

In [147]:
df.head()

      Name Age      City
0  Aashish  19  Motihari
1  Aarunee  22    Ballia
2   Ranjan  15    Jammmu
3   Aditya  62     Patna

In [148]:
city = df.at[2, 'City']
print(city)
df.iat[1,2]

Jammmu

'Ballia'

In [149]:
## Data Manipulation 

df['Salary'] = ['125111','2564','46548','415415']
df

      Name Age      City  Salary
0  Aashish  19  Motihari  125111
1  Aarunee  22    Ballia    2564
2   Ranjan  15    Jammmu   46548
3   Aditya  62     Patna  415415

In [150]:
df.drop('Salary', axis=1, inplace=True)

In [151]:
df.info()
df['Age'] = df['Age'].astype(int)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      object
 2   City    4 non-null      object
dtypes: object(3)
memory usage: 228.0+ bytes

In [152]:
df['Age'] = df['Age'] + 1
df

      Name  Age      City
0  Aashish   20  Motihari
1  Aarunee   23    Ballia
2   Ranjan   16    Jammmu
3   Aditya   63     Patna

In [153]:
# df.drop('Age', axis= 1, inplace=True)
df

      Name  Age      City
0  Aashish   20  Motihari
1  Aarunee   23    Ballia
2   Ranjan   16    Jammmu
3   Aditya   63     Patna

In [154]:
df.describe()

             Age
count   4.000000
mean   30.500000
std    21.855587
min    16.000000
25%    19.000000
50%    21.500000
75%    33.000000
max    63.000000

In [155]:
df = pd.read_csv('data/sales_data_sample.csv', encoding='latin1')
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [156]:
df.describe()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,7.092455,2003.81509,100.715551
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,3.656633,0.69967,40.187912
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,2003.00000,33.000000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,4.000000,2003.00000,68.000000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,8.000000,2004.00000,99.000000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,11.000000,2004.00000,124.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,12.000000,2005.00000,214.000000

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB

In [158]:
df.isnull().sum()

ORDERNUMBER            0
QUANTITYORDERED        0
PRICEEACH              0
ORDERLINENUMBER        0
SALES                  0
ORDERDATE              0
STATUS                 0
QTR_ID                 0
MONTH_ID               0
YEAR_ID                0
PRODUCTLINE            0
MSRP                   0
PRODUCTCODE            0
CUSTOMERNAME           0
PHONE                  0
ADDRESSLINE1           0
ADDRESSLINE2        2521
CITY                   0
STATE               1486
POSTALCODE            76
COUNTRY                0
TERRITORY           1074
CONTACTLASTNAME        0
CONTACTFIRSTNAME       0
DEALSIZE               0
dtype: int64

In [159]:
df.dtypes

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [160]:
## Renaming

df.rename(columns={
    'CITY' : 'CITY_RENAMED'
}, inplace=True)

df.dtypes

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY_RENAMED         object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [161]:
### Data Aggregating and Grouping 

df = pd.read_csv("data/data.csv")
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [162]:
groupedData = df.groupby('Category')['Value'].sum()
groupedData

Category
A     677.0
B     618.0
C    1137.0
Name: Value, dtype: float64

In [163]:
groupedData = df.groupby(['Product', 'Region'])['Value'].agg(['mean', 'sum', 'std'])
groupedData

                      mean    sum        std
Product  Region
Product1 East    41.714286  292.0  33.663602
         North    4.500000    9.0   3.535534
         South   50.000000  100.0  62.225397
         West    82.000000  246.0  17.578396
Product2 East    28.000000   56.0   5.656854
         North   63.500000  127.0  10.606602
         South   60.333333  181.0  29.143324
         West    53.500000  428.0  30.495901
Product3 East    50.500000  202.0  31.032241
         North   40.600000  203.0  23.158152
         South   71.666667  215.0   9.609024
         West    62.166667  373.0  19.528611

In [164]:
## Merging Data Frames 

df1 = pd.DataFrame({
    'Key' : ['A', 'B', 'C'],
    'Value1' : [1,2,3]
})

df2 = pd.DataFrame({
    'Key' : ['A', 'B', 'D'],
    'Value2' : [4,5,6]
})

In [165]:
pd.merge(df1,df2, on='Key', how='inner')

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [166]:
pd.merge(df1, df2, on='Key', how='outer')

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [167]:
pd.merge(df1, df2, on='Key', how='left')

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [168]:
pd.merge(df1, df2, on='Key', how='right')

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6